{
    "English": {
        "vocabulary": {
            "1": "Has the ability to use common, introductory words and phrases to express oneself.",
            "1.5": "Has a growing vocabulary of daily, common words and expressions that can be used in everyday situations.",
            "2": "Has fundamental vocabulary of individual terms and phrases about specific, everyday situations.",
            "2.5":"Has a continuously expanding basic set of words and phrases for commonplace, everyday situations.",
            "3": "Possesses rudimentary vocabulary terms and phrases pertaining to personal information and fundamental practical needs.",
            "3.5":	"Displays a foundational vocabulary for addressing personal details and basic needs that is working towards having sufficient knowledge in these aspects.",
            "4"	:"Demonstrates satisfactory vocabulary with fundamental communication and essential survival situations.",
            "4.5": "Adequately addresses fundamental communication and survival needs while building the vocabulary needed for common, intermediate interactions about familiar subjects.",
            "5": "Possesses solid vocabulary for handling regular, everyday interactions about common subjects.",
            "5.5": "Has adequate vocabulary for dealing with familiar and routine subjects, with ongoing vocabulary development for a broader range of daily life topics.",
            "6": "Show a satisfactory vocabulary foundation to communicate about topics such as personal interests, career, travel and recent news with some rephrasing needed.",
            "6.5": "Is capable of handling regular, familiar  interactions and topics with the aim of achieving greater competency.", 
            "7": "Exhibits functional, practical vocabulary and can navigate known conversation topics and commonplace events with relative ease.",
            "7.5": "Has developed a broad vocabulary for familiar topics and regular situations, aiming towards using advanced and / or natural language in their respective professional field and other specialized fields of interest.",
            "8":	"Uses much of the specific and natural language across a variety of contexts and topics, especially within subject matter where a level of expertise within the domain has been sought after.",
            "8.5": "Demonstrates the ability to use much of the specific and natural language across areas within his/her field and interests.  Is working on acquiring proficiency in using technical and natural terminology in other unfamiliar subjects, specialized and broad.", 
            "9":	"Maintains a strong grasp of key technical terms and natural language for both specialized and general, everyday subjects.",
            "9.5": "Currently improving upon using less descriptive language and evasion techniques and more technical and natural language when using vocabulary across all subject matter.",
            "10": "Exhibits a rich lexicon that enables speaking and discussing any topic smoothly with ease; little to no issues with deriving, recalling and utilizing language with precision and accuracy.",
            "10+":"Has a sophisticated lexical range and verbal arsenal that allows speaking of general and complex subjects with little to no difficulty, with aspirations of speaking identically to that of a native speaker in terms of modern natural language, colloquial expressions and slang"
        },
        "grammar": {
                "1": "Grasps basic question and subject-verb-object patterns.",
                "1.5": "Shows the ability to correctly arrange words in simple, short sentences and is working towards understanding and using an increasing range of grammar structures.",
                "2": "Understands a narrow range of familiar, introductory grammar rules and fundamental sentence patterns.",
                "2.5": "Is progressing towards increasing the range of learnt grammar structures and sentence patterns in short, clear sentences.",
                "3": "Demonstrates control of a limited amount of familiar basic grammar rules and sentence structure.",
                "3.5": "Is moving towards acquiring higher accuracy towards learnt grammar and sentence patterns while maintaining coherence. Has increased comfortability in describing actions and states.",
                "4": "Can further enhance accuracy in introductory grammar and sentence structures. While elementary mistakes are present, frequent confusion or misunderstanding is rare.",
                "4.5": "Is working on continuous improvement of grammar and sentence pattern correctness for consistent coherence. Is starting to use more complex forms.",
                "5": "Has made progress in introductory grammar and sentence structure, with room to further refine accuracy. It is uncommon to have significant clarity and coherence issues for fundamental English mistakes.",
                "5.5": "Has increased accuracy of basic grammar and sentence structure usage with further accuracy improvement needed. Is becoming more experienced in using common, routine grammar and sentence patterns.",
                "6": "Effectively applies familiar routine and sentence pattern sets in expected scenarios while being fairly accurate. Is in the process of refining their understanding of intermediate grammar concepts.",
                "6.5": "Is moving towards consistently expressing thoughts clearly in well-known contexts more accurately while limiting native language influences. Is beginning to develop a good grasp of intermediate-level grammar.",
                "7": "Expresses ideas clearly in known situations despite some recognition of native language influences. Clarity is maintained in spite of occasional mistakes.",
                "7.5": "Is handling basic, routine situations well and is starting to use more advanced grammar and sentence forms while continuing to build upon flexibility and accuracy in using complex structures.",
                "8": "Handles basic, routine structures confidently and is in the process of incorporating more advanced grammar and sentence forms with precision and versatility.",
                "8.5": "Is improving upon understanding and execution of more advanced grammar concepts. Is able to self-correct and has a good control of intermediate and advanced grammar concepts and sentence patterns.",
                "9": "Has control over grammar and sentence structures with minor inconsistencies being infrequent. Consistent self-correction occurs when these inconsistencies are present.",
                "9.5": "Commands a wide range of natural and advanced grammatical structures in which self-correction is possible for inconsequential mistakes. Is in the process of achieving near-perfect accuracy.",
                "10": "Demonstrates grammar fluency of a wide range of grammar structures with accuracy and relevance by recognizing nuances and subtle distinctions between contexts, tones, and formalities.",
                "10+": "Is demonstrating complete control of all aspects of grammar. Is in the process of mastery of being versatile and adaptable with grammar in different contexts, tones, and formalities with precision and clarity."
            
        },
        "pronunciation": {
            "1": "Exhibits an accent with distinct native language influences on the targeted language, making comprehension challenging at times.",
            "1.5": "Pronunciation includes a noticeable accent and requires enunciation of key phonetic sounds. Is working towards clear articulation of basic phonetic sounds and general words in short form.",
            "2": "Pronunciation of a small set of familiar words are recognized with some effort by native speakers accustomed to various accents. Basic stress patterns and enunciation are becoming more apparent.",
            "2.5": "Is understanding and increasing the accuracy of short phonetic combinations. Intonation is beginning to become apparent when speaking. Able to be understood by native speakers with experience with the speaker, but effort is required at times.",
            "3": "Increased occasions of using the appropriate simple and common phonetic sounds. The learner is able to use intonation more often for common, routine words and phrases. Effort is needed by native speakers to fully understand what has been said at times.",
            "3.5": "Pronunciation has improved to the point of being understood despite a noticeable accent. Being asked to repeat spoken words occurs often but has been steadily decreasing.",
            "4": "Pronunciation typically has enough phonetic and intonational correctness to be understood in spite of a foreign accent being apparent. Repetition may be asked at times because of more advanced phonetic sounds, stress, and intonation of unfamiliar words.",
            "4.5": "Is understanding and practicing the principles of basic word stress, intonation, and rhythm to better communicate familiar information with a higher frequency of intelligibility.",
            "5": "Is beginning to grasp the use of chunking and pausing within their speech to better increase understanding. Basic foundational pronunciation aspects are being improved upon such that being asked to repeat because of those aspects are decreasing.",
            "5.5": "Is in the process of becoming generally intelligible, where basic to intermediate level phonics, intonation, and stress are more evident despite native language influences.",
            "6": "Native language influences on pronunciation, although apparent, have generally decreased. Is having a stronger grasp of using speaking rhythm: pausing, chunking, word, and sentence stress.",
            "6.5": "Is in the process of further improving pronunciation accuracy of learnt concepts to decrease the situations of misunderstandings or confusion.",
            "7": "Accuracy of familiar and common pronunciations have increased through a better understanding of introductory to intermediate pronunciation techniques such as stress, intonation, phonics, chunking, and pausing.",
            "7.5": "Is achieving a better comprehension and execution of pronunciation concepts such as stress, intonation, phonics, chunking, and pausing while decreasing native language impact on intelligibility.",
            "8": "Intonation and stress are generally used well, though the accent reflects native language influences, with minimal impact on clarity.",
            "8.5": "Is having a deeper understanding of connected speech and linking to have better spoken word flow. Is focusing on continuous improvement of common and uncommon intonation and stress.",
            "9": "Uses intonation and stress effectively. Pronunciation remains clear and is articulated well. Accent has little or no effect on clarity.",
            "9.5": "Demonstrates the ability to use most pronunciation concepts effortlessly with little inaccuracies. Advanced forms of pronunciation such as vocal projection are being practiced and improved upon.",
            "10": "Maintains complete control over phonological concepts to maintain clear conversation. Most sounds are articulated with high accuracy and precision.",
            "10+": "Is aspiring to have complete mastery as to that of a native speaker. Advanced forms of pronunciation such as vocal projection and tone are being perfected."
        },
        "listening": {
            "1": "Can identify basic sounds and simple words that are a part of everyday language, provided that it is spoken slowly and enunciated clearly.",
            "1.5": "Can determine common, familiar words when spoken slowly and clearly in everyday situations. Is working on picking out specific details on familiar topics.",
            "2": "Able to identify common intonation patterns and simple stress in words. Uses context and visual clues to grasp basic meanings and clear phrases, provided that it is delivered in a slow and clear way.",
            "2.5": "Is in the process of keeping up with speech that is slow and well-articulated, with speaking pauses to process the information.",
            "3": "Is able to understand slow and clear speech that provides time for comprehension. Is beginning to distinguish clear stress patterns, simple intonation, and focus on context to understand.",
            "3.5": "Is developing an understanding of phrases and expressions related to important speaking situations, such as personal and familial information, provided that speech is articulated in a clear and slow way.",
            "4": "Has a better understanding of intonation and stress such that essential phrases related to immediate concerns are more easily comprehended.",
            "4.5": "Is experimenting with segmenting spoken words into more understandable segments, provided that speech is clear and slow.",
            "5": "Can grasp sufficient details to meet specific needs when speech is clear and slow.",
            "5.5": "Is familiarizing oneself with chunking to comprehend main points when topics are spoken at a moderately slow speed. Is beginning to understand the key points of common, daily life topics such as work, school, leisure, and small talk.",
            "6": "Comprehends the key points of common, routine matters related to career, schooling, interests, and small talk.",
            "6.5": "Is becoming able to listen at a moderate speed to understand daily life and general work-related dialogue. Is starting to become accustomed to listening to unfamiliar accents.",
            "7": "Has the ability to comprehend general work and daily life-related topics. Is becoming more adept at identifying main points and nuances within the speech. Able to listen to a native speaker at a moderately fast speed.",
            "7.5": "Has made progress in understanding detailed information and complex arguments in various contexts. Is improving upon using context and chunking to follow discussions with diverse accents and faster speech.",
            "8": "Grasps key points of complex discussions on a variety of topics, including technical content in their area of expertise when spoken to during regular conversation. Is able to listen to a native speaker at a fast speed.",
            "8.5": "Is moving towards understanding the main ideas in detailed speech on both common and specialized topics. Is progressing towards comprehension of broader discussions in various contexts.",
            "9": "Demonstrated the ability to comprehend spoken communication on a variety of topics that are commonly or uncommonly encountered in everyday, academic, or work situations. Has the ability to listen to a native speaker at near-native speed.",
            "9.5": "Is in the process of grasping lengthy spoken content across various subjects by utilizing advanced listening skills and contextual clues to discern main points and subtle details. Is becoming accustomed to listening at native speed, of a variety of native accents, with the occasional need for clarification.",
            "10": "Has the ability to comprehend spoken language at native speed. Can better interpret the main points and nuances of complex and detailed matters outside of primary knowledge areas. Occasional clarification is still needed at times, particularly when accents differ greatly from the learner’s listening experiences.",
            "10+": "Is becoming more able to follow and interpret lengthy discourse beyond familiar areas. Is progressing towards mastery of advanced listening techniques to grasp nuanced arguments, intricate details, and varied accents with ease."
        },
        "conversation": {
            "1": "Asks and answers questions about personal details and daily activities, using brief, short phrases and supportive non-verbal gestures.",
            "1.5": "Accustoming oneself to exchanges in basic, short interactions. Is reliant on repetition, slower speech, and rephrasing to maintain understanding.",
            "2": "Engages in basic interaction, with communication relying heavily on repetition, slower speech, and restating information. Is able to use simple speaking structures to express basic needs and preferences.",
            "2.5": "Is able to construct basic sentences to convey information. Is working on providing more detailed answers and formulating appropriate, introductory questions.",
            "3": "Handles straightforward, common conversations with an emphasis on enhancing communication by practicing repetition and adjusting speech rate for better understanding.",
            "3.5": "Is progressing towards better participation in straightforward exchanges while handling simple speaking tasks and direct information sharing in familiar situations.",
            "4": "Manages basic tasks and exchanges related to routine work and leisure. Handles very brief social interactions effectively.",
            "4.5": "Is linking ideas in longer sentences and relating events in a sequence of basic descriptions. Is starting to show confidence in starting and having conversations on familiar topics.",
            "5": "Engages comfortably in structured interactions and brief conversations with some assistance when appropriate. Has the ability to share thoughts on familiar topics in everyday settings.",
            "5.5": "Is practicing navigating conversations on familiar topics with ease by sharing personal information and daily matters in more structured sentences, even without prior preparation.",
            "6": "Can actively join spontaneous conversations on familiar topics, share personal insights, and discuss everyday matters. Able to ask for clarity, clarify, and paraphrase to ensure understanding.",
            "6.5": "Is starting to be more comfortable speaking about both regular and less familiar personal and professional subject matter, including confirming and exchanging information in various contexts.",
            "7": "Communicates relatively smoothly on a range of familiar and less common topics related to personal and professional areas while managing conversations with some ease and verifying details when needed.",
            "7.5": "Is moving towards sustaining longer, more complex conversations on a wide range of topics. Is working on effective presentation and defense of viewpoints with appropriate language structures.",
            "8": "Contributes in conversation with a comfortable flow that ensures natural exchanges and meaningful, sustained interactions with speakers of the targeted language without added effort.",
            "8.5": "Participates in discussion with fluency and spontaneity while adjusting to different levels of formality when needed. Is becoming more practiced in telling detailed stories, explaining processes clearly, and convincing others with well-structured arguments and reasoning.",
            "9": "Expresses thoughts and ideas freely and accurately, adapting the level of formality as needed while sustaining linguistic accuracy.",
            "9.5": "Is approaching fluent and natural communication with a strong grasp of language structure and formality. Is progressing towards being adept at expressing subtle distinctions, handling abstract and complex topics, and using advanced speaking techniques.",
            "10": "Handles diverse topics with confidence, using language flexibly and accurately to convey ideas without effort, adjusting tone and formality as needed.",
            "10+": "Is progressing towards fluency in spontaneous conversation on any topic with ease. Is at the level where continuous learning and incorporation of cultural references and idioms naturally is needed. Is becoming more practiced in handling abstract, complex arguments with precision and depth."
        }
        }
    }

    